{
    "15/Jun/2023": {
        "summary": "* **Vivek won the match by 10 wickets.** They chased down the target of 62 runs in just 8.4 overs, losing only one wicket.\n* **Abin was the star performer for Vivek with the bat, scoring 28 runs off 19 balls.** He hit four fours in his innings.\n* **Swamiji was the top scorer for Banerjee with 30 runs off 35 balls.** He hit two fours in his innings.\n* **Debu was the most successful bowler for Banerjee, taking 2 wickets for 4 runs in 1 over.**\n* **Vivek's bowling attack was more economical than Banerjee's, with an economy rate of 7.27 compared to 8.40.**\n* **The match was played on a batting-friendly wicket, as evidenced by the high scores of both teams.**\n\nOverall, it was a close match that was decided by Vivek's superior batting performance.\n\nHere are some additional observations:\n\n* **Banerjee lost their first 4 wickets for just 15 runs.** This put them in a difficult position from which they were unable to recover.\n* **Vivek's opening partnership of 28 runs between Abin and Prafull set the tone for their innings.** This partnership gave them a good platform to build on.\n* **The match was affected by rain, with the last few overs being reduced.** This meant that Banerjee did not have enough time to chase down the target.\n\nI hope this helps!"
    },
    "16/Jun/2023": {
        "summary": "* The match was discontinued as Teja needed 3 runs in the last ball to win, but the match was stopped due to rain.\n* Abin scored the most runs for Abin, with 46 runs off 38 balls.\n* Teja scored the most runs for Teja, with 20 runs off 21 balls.\n* Qasim was the most successful bowler for Abin, with 2 wickets for 10 runs in 2.1 overs.\n* Gourab was the most successful bowler for Teja, with 2 wickets for 10 runs in 1.2 overs.\n* The match was played on a batting-friendly wicket, as evidenced by the high scores of both teams.\n\nHere are some additional observations:\n\n* Abin lost their first wicket in the 2nd over, but recovered well to post a challenging total of 108 runs.\n* Teja lost their first wicket in the 1st over, but recovered well to get close to the target before the rain stopped play.\n* The match was evenly poised when it was discontinued, with Teja needing 3 runs in the last ball to win.\n\nOverall, it was a close match that was decided by the weather."
    },
    "12/July/2023": {
        "summary": "* Qasim won the match by 4 runs.\n* Qasim scored the most runs for Qasim, with 20 runs off 20 balls.\n* Swapnil scored the most runs for Swapnil, with 10 runs off 10 balls.\n* Qasim was the most successful bowler for Qasim, with 2 wickets for 12 runs in 2.4 overs.\n* Swapnil was the most successful bowler for Swapnil, with 8 wickets for 17 runs in 12 overs.\n* The match was played on a batting-friendly wicket, as evidenced by the high scores of both teams.\n\nHere are some additional observations:\n\n* Qasim lost their first wicket in the 1st over, but recovered well to post a challenging total of 74 runs.\n* Swapnil lost their first wicket in the 1st over, but recovered well to get close to the target before falling short by 4 runs.\n* Qasim's bowlers were more economical than Swapnil's bowlers, with an economy rate of 5.83 compared to 6.5.\n* The match was decided by a few key moments, such as Qasim's run out of Banerjee in the 11th over and Swapnil's wicket of Qasim in the 12th over.\n\nOverall, it was a close match that was decided by a few key moments."
    },
    "14/July/2023": {
        "summary": "* Qasim won the match by 16 runs.\n* Swamiji was the top scorer for Qasim, with 38 runs off 25 balls.\n* Swapnil was the top scorer for Swapnil, with 30 runs off 20 balls.\n* Banerjee was the most successful bowler for Qasim, with 4 wickets for 21 runs in 6 overs.\n* Swapnil was the most successful bowler for Swapnil, with 5 wickets for 32 runs in 12 overs.\n* The match was played on a batting-friendly wicket, as evidenced by the high scores of both teams.\n\nHere are some additional observations:\n\n* Qasim lost their first wicket in the 0.4 over, but recovered well to post a challenging total of 98 runs.\n* Swapnil lost their first wicket in the 5.1 over, but recovered well to get close to the target before falling short by 16 runs.\n* Qasim's bowlers were more economical than Swapnil's bowlers, with an economy rate of 6.83 compared to 8.17.\n* The match was decided by a few key moments, such as Banerjee's wicket of Swapnil in the 6th over and Swapnil's wicket of Milan in the 5.1 over.\n\nOverall, it was a close match that was decided by a few key moments."
    },
    "27/Jul/2023": {
        "summary": "* Qasim won the match by 8 runs.\n* Banerjee was the top scorer for Qasim, with 20 runs off 16 balls.\n* Gourab was the top scorer for Gourab, with 10 runs off 9 balls.\n* Banerjee was the most successful bowler for Qasim, with 2 wickets for 8 runs in 1 over.\n* Tilak was the most successful bowler for Gourab, with 2 wickets for 5 runs in 1 over.\n* The match was played on a batting-friendly wicket, as evidenced by the high scores of both teams.\n\nHere are some additional observations:\n\n* Qasim lost their first wicket in the 0.4 over, but recovered well to post a challenging total of 41 runs in 5 overs.\n* Gourab lost their first wicket in the 0.4 over, but recovered well to get close to the target before falling short by 8 runs.\n* Qasim's bowlers were more economical than Gourab's bowlers, with an economy rate of 6.6 compared to 8.2.\n* The match was decided by a few key moments, such as Banerjee's wicket of Gourab in the 4.3 over and Tilak's wicket of Roshan in the 2.4 over.\n\nOverall, it was a close match that was decided by a few key moments.\n\nHere are some other observations:\n\n* Qasim's batting was more reliant on their top order, with Banerjee scoring 20 runs and Debarshi scoring 8 runs.\n* Gourab's batting was more evenly spread, with Gourab, Utsab, and Milan all scoring 7 runs each.\n* Qasim's bowling attack was more effective in the early overs, taking 4 wickets in the first 4 overs.\n* Gourab's bowling attack was more effective in the middle overs, taking 3 wickets in the 3rd and 4th overs.\n\nOverall, it was a well-contested match that could have gone either way."
    },
    "17/Aug/2023": {
        "summary": "* Swamiji won the match by 3 runs.\n* Shubham was the top scorer for Tilak, with 30 runs off 18 balls.\n* Swamiji was the top scorer for Swamiji, with 36 runs off 30 balls.\n* Rajkumar was the most successful bowler for Swamiji, with 3 wickets for 23 runs in 4 overs.\n* Utsab was the most successful bowler for Tilak, with 2 wickets for 18 runs in 2 overs.\n* The match was played on a batting-friendly wicket, as evidenced by the high scores of both teams.\n\nHere are some additional observations:\n\n* Swamiji lost their first wicket in the 0.4 over, but recovered well to post a challenging total of 112 runs in 15 overs.\n* Tilak lost their first wicket in the 1.1 over, but recovered well to get close to the target before falling short by 3 runs.\n* Swamiji's bowlers were more economical than Tilak's bowlers, with an economy rate of 7.27 compared to 7.33.\n* The match was decided by a few key moments, such as Rajkumar's wicket of Dheeraj in the 1.1 over and Utsab's wicket of Swamiji in the 13.1 over.\n\nOverall, it was a close match that was decided by a few key moments.\n\nHere are some other observations:\n\n* Swamiji's batting was more reliant on their top order, with Swamiji and Qasim scoring 36 runs each.\n* Tilak's batting was more evenly spread, with Shubham, Utsab, and Debu all scoring 17 runs each.\n* Swamiji's bowling attack was more effective in the middle overs, taking 3 wickets in the 5th, 6th, and 7th overs.\n* Tilak's bowling attack was more effective in the early overs, taking 2 wickets in the first 2 overs.\n\nOverall, it was a well-contested match that could have gone either way."
    }
}